[{"id":1,"course":{"id":4,"name":"Front-End Development","overview":"Ovo je intenzivni kurs namenjen onima koji žele da steknu kompentecije junior developer-a za razvoj klijentskog dela web aplikacija. Gradivo obuhvata koncepte web dizajna, osnovno i napredno JavaScript programiranje uključujući TypeScript i izradu modernih klijentskih aplikacija upotrebom Angular radnog okvira.","weeks":14,"classes":120,"classesPerWeek":12,"description":"Kurs je namenjen onima koji žele da steknu kompetencije junior developer-a za razvoj klijentskog dela web aplikacija. Polaznici koji uspešno završe kurs, preporučuju se za poziv na selekciju za zaposlenje u kompanijama sa kojima FTN Informatika ima dogovor o saradnji. O kojim se kompanijama radi možete pogledati u sekciji Partneri.\n\nZa pohađanje kursa neophodno je da polaznici imaju predznanje iz osnova programiranja u nekom od programskih jezika visokog nivoa (JavaScript, Java, C++, C# i slično). Kao pomoć u proceni programerskih veština interesenata za kurs, organizujemo besplatna preliminarna testiranja. Ukoliko znate da nemate predznanje iz programiranja ili to ustanovite na preliminarnom testiranju, možete se opredeliti za pohađanje kursa Osnove programiranja, koji organizujemo kao pripremu za uspešno praćenje nastave na Front-End Development kursu.\n\nKurs Front-End Development je podeljen na tri modula: Osnove web dizajna i klijentskog web programiranja (modul 1), JavaScript i TypeScript programiranje (modul 2) i Angular programiranje (modul 3). Svaki termin nastave se sastoji iz kraćeg teoretskog dela, u kojem se polaznici upoznaju sa odgovarajućim konceptima, i većeg broja primera i zadataka, kroz koje polaznici primenjuju naučene koncepte u praksi. Na kraju svakog predavanja polaznici dobijaju domaće zadatke namenjene za utvrđivanje gradiva i sticanje samostalnosti u radu. Za polaznike kursa obezbeđen je računar, softver neophodan za realizaciju nastave i nastavni materijal u elektronskoj formi.","price":106800,"modules":[{"name":"Modul 1. Osnove web dizajna i klijentskog web programiranja","subjects":["Rad sa Visual Studio Code editorom izvornog koda za efikasniju izradu aplikacija","Opštu arhitekturu web-baziranih sistema i HTTP protokol","Osnovne HTML koncepte i napredne HTML 5 komponente","Osnovne i napredne CSS konstrukcije, uključujući i SASS skript jezik","Opšte principe web-dizajna i razvoja user-friendly web-stranica","Korišćenje Git sistema za kontrolu verzija i timski rad"]},{"name":"Modul 2. JavaScript i TypeScript programiranje","subjects":["Fundamentalne JavaScript koncepte, uključujući objekte, funkcije, manipulisanje DOM-om i njegovim modelom događaja","Osnove TypeScript jezika, koji omogućava lakši razvoj kompleksnih JavaScript aplikacija","Alate za razvijanje front-end aplikacije koje web-čitač nudi, poput konzole, debagera i alata za praćenje mrežne komunikacije"]},{"name":"Modul 3. Angular programiranje","subjects":["Angular 16 JavaScript radni okvir, od njegovih osnovnih koncepata poput modula, komponenti i servisa, do naprednih mogućnosti poput rutiranja","Rad sa spoljnim bibliotekama, što podrazumeva analizu dokumentacije i integraciju tuđeg koda u sopstveno rešenje","Rad sa pratećim alatima, uključujući Node, npm i webpack kako bi se upravljalo kompleksnim projektima kroz organizaciju spoljnih biblioteka i automatizaciju poslova"]}],"grading":"Na kraju svakog modula se organizuje poseban termnin za ispit. Rezultati sa parcijalnih ispita nakon 1. i 2. modula nose po 15% ukupno mogućih bodova (100). Nakon 3. modula organizuje se završni ispit koji nosi 70% ukupno mogućih bodova. Sertifikacija se vrši na osnovu zbira rezultata ostvarenih na sva tri ispita.\n\nPo završetku kursa polaznicima se dodeljuje sertifikat o pohađanju ili uspešno završenom kursu, u zavisnosti od rezultata ostvarenih na ispitima. Kurs je uspešno završen ako ukupan broj bodova ostvaren na ispitima iznosi najmanje 50% mogućih bodova.","image":"frontend.png"},"name":"a","eMail":"a@a.com","tel":"a","address":"a","date":"2024-03-19T18:54:41.062Z"},{"id":3,"course":{"id":2,"name":"Java Web Development","overview":"Ovo je intenzivni kurs namenjen onima koji žele da steknu kompetencije junior full stack developer-a za razvoj web aplikacija na Java platformi. Gradivo obuhvata razvoj serverskog dela web aplikacija upotrebom Java tehnologija i klijentskog dela web aplikacija korišćenjem React frameworka.","weeks":15,"classes":132,"classesPerWeek":12,"description":"Kurs je namenjen onima koji žele da steknu kompetencije junior full stack developer-a za razvoj web aplikacija na Java platformi. Polaznici koji uspešno završe kurs se preporučuju za poziv na selekciju za zaposlenje u kompanijama sa kojima FTN Informatika ima dogovor o saradnji. O kojim se kompanijama radi možete pogledati u sekciji Partneri.\n\nZa pohađanje kursa neophodno je da polaznici imaju predznanje iz osnova programiranja u nekom od programskih jezika visokog nivoa (Java, JavaScript, C++, C# i slično). Kao pomoć u proceni programerskih veština interesenata za kurs, organizujemo besplatna preliminarna testiranja. Ukoliko znate da nemate predznanje iz programiranja ili to ustanovite na preliminarnom testiranju, možete se opredeliti za pohađanje kursa Osnove programiranja, koji organizujemo kao pripremu za uspešno praćenje nastave na Java Web Development kursu.\n\nKurs Java Web Development je podeljen na tri modula: Osnove Java programiranja (modul 1), Osnove veb programiranja (modul 2) i Napredno veb programiranje (modul 3). Svaki termin nastave se sastoji iz kraćeg teoretskog dela, u kojem se polaznici upoznaju sa odgovarajućim konceptima i većeg broja primera i zadataka, kroz koje polaznici primenjuju naučene koncepte u praksi. Na kraju svakog predavanja polaznici dobijaju domaće zadatke, namenjene za utvrđivanje gradiva i sticanje samostalnosti u radu. Za polaznike kursa obezbeđen je računar, softver neophodan za realizaciju nastave i nastavni materijal u elektronskoj formi.","price":106800,"modules":[{"name":"Modul 1. Osnove Java Programiranja","subjects":["Korišćenje Eclipse okruženja","Poznavanje osnovnih koncepata objektnog programiranja (apstrakcija, generalizacija, polimorfizam)","Sposobnost programiranja osnovnih algoritamskih struktura","Sposobnost rada sa ulazom i izlazom (standardni ulaz/izlaz i fajl sistem)","Elementarni rad sa bazama podataka (osnove relacionog modela, SQL jezika i mehanizmi povezivanja Java aplikacije sa bazom podataka)","Korišćenje eksternih Java biblioteka","Korišćenje GIT sistema za kontrolu verzija programskog koda i timski rad","Korišćenje JUnit biblioteke za testiranje softvera"]},{"name":"Modul 2. Osnove web programiranja","subjects":["Poznavanje osnovnih i jednog dela naprednih HTML 4 i HTML 5 koncepata i struktura","Poznavanje osnovnih i jednog dela naprednih CSS koncepata i struktura","Korišćenje Eclipse java EE okruženja sa akcentom na segment za veb programiranje","Sposobnost korišćenja Apache Tomcat veb servera (bazični principi, puštanje aplikacije u produkciju - deploy)","Sposobnost korišćenja Maven alata za izgradnju tj. konstrukciju projekta kompleksnih aplikacija","Poznavanje koncepata i tehnologija Spring, Spring Boot, MVC (Model View Controler), Thymeleaf","Poznavanje Dependency injection i Inversion of Control šablona","Sposobnost programiranja bazične veb aplikacije koja koristi bazu podataka","Poznavanje osnovnih i jednog dela naprednih struktura JavaScript programskog jezika","Poznavanje osnovnih i jednog dela naprednih struktura Jquery i AJAX tehnologija","Sposobnost izrade kompetne veb aplikacije bazirane MVC arhitekturi"]},{"name":"Modul 3. Napredno web programiranje","subjects":["Poznavanje osnova objektno-relacionog mapiranja","Korišćenje Spring Data JPA uz Hibernate implementaciju","Osnove rada sa transakcijama","Poznavanje REST koncepata","Poznavanje sigurnosnih koncepata sa Spring Security","Autorizacija i Autentifikacija","Poznavanje Data Transfer Object koncepta","Sposobnost izrade REST servisa korišćenjem Spring frameworka","Poznavanje JavaScript-a i koncepata potrebnih za razumevanje React framework-a","Poznavanje ES6","Ovladavanje single-page application (SPA) konceptom","Korišćenje Bootstrap i Redux biblioteke, Sorting, Pagination","Korišćenje React frameworka za razvoj klijentskih front-end aplikacija (funkcijske komponente, klase, komponente, korišćenje JSX-a, properties, state, rutiranje, CRUD, asinhronost)"]}],"grading":"Na kraju svakog modula organizuje se poseban termin za ispit. Rezultati sa parcijalnih ispita nakon 1. i 2. modula ne utiču na sertifikaciju i služe kao informacija polazniku u kojoj meri je savladao gradivo. Nakon 3. modula organizuje se završni ispit, na osnovu kojeg se vrši sertifikacija.\n\nPo završetku kursa polaznicima se dodeljuje sertifikat o pohađanju ili uspešno završenom kursu, u zavisnosti od rezultata ostvarenog na završnom ispitu. Kurs je uspešno završen, ako polaznik na završnom ispitu ostvari najmanje 50% ukupno mogućih bodova (100).","image":"java.png"},"name":"a","eMail":"a@a.com","tel":"a","address":"a","date":"2024-03-19T19:34:09.656Z"},{"id":4,"course":{"id":3,"name":".NET Web Development","overview":"Ovo je intenzivni kurs namenjen onima koji žele da steknu kompetencije junior full stack developer-a za razvoj web aplikacija na .NET platformi. Gradivo obuhvata razvoj serverskog dela web aplikacija upotrebom .NET tehnologija i klijentskog dela web aplikacija korišćenjem JavaScript jezika i pridruženih tehnologija.","weeks":15,"classes":132,"classesPerWeek":12,"description":"Kurs je namenjen onima koji žele da steknu kompetencije junior full stack developer-a za razvoj web aplikacija na .NET platformi. Polaznici koji uspešno završe kurs se preporučuju za poziv na selekciju za zaposlenje u kompanijama sa kojima FTN Informatika ima dogovor o saradnji. O kojim se kompanijama radi možete pogledati u sekciji Partneri.\n\nZa pohađanje kursa neophodno je da polaznici imaju predznanje iz osnova programiranja u nekom od programskih jezika visokog nivoa (C#, Java, JavaScript, C++ i slično). Kao pomoć u proceni programerskih veština interesenata za kurs, organizujemo besplatna preliminarna testiranja. Ukoliko znate da nemate predznanje iz programiranja ili to ustanovite na preliminarnom testiranju, možete se opredeliti za pohađanje kursa Osnove programiranja, koji organizujemo kao pripremu za uspešno praćenje nastave na .NET Web Development kursu.\n\nKurs .NET Web Development je podeljen na tri modula: Osnove C# programiranja (modul 1.), Osnove web programiranja (modul 2.) i Napredno web programiranje (modul 3.). Predavanja se sastoje iz kraćeg teoretskog dela, u kojem se polaznici upoznaju sa odgovarajućim konceptima i većeg broja zadataka, u kojima polaznici primenjuju naučene koncepte u praksi. Na kraju svakog predavanja polaznici dobijaju domaće zadatke, namenjene za utvrđivanje gradiva i sticanje samostalnosti u radu. Za svakog polaznika kursa obezbeđen je računar, softver neophodan za realizaciju nastave i nastavni materijal u elektronskoj formi.","price":106800,"modules":[{"name":"Modul 1. Osnove C# Programiranja","subjects":["Korišćenje Visual Studio okruženja","Poznavanje osnovnih koncepata objektnog programiranja (apstrakcija, generalizacija, polimorfizam)","Sposobnost programiranja osnovnih algoritamskih struktura i korišćenje funkcija","Sposobnost rada sa ulazom i izlazom (standardni ulaz/izlaz i fajl sistem)","Elementarni rad sa bazama podataka (osnove relacionog modela, SQL jezika i mehanizmi povezivanja C# aplikacije sa bazom podataka)","Korišćenje eksternih .NET biblioteka","Korišćenje GIT sistema za kontrolu verzija programskog koda","Korišćenje biblioteke za Unit testiranje softvera"]},{"name":"Modul 2. Osnove web programiranja","subjects":["Poznavanje osnovnih i jednog dela naprednih HTML 4 i HTML 5 koncepata i struktura","Poznavanje osnovnih i jednog dela naprednih CSS koncepata i struktura","Korišćenje Visual Studio okruženja sa akcentom na segment za web programiranje","Sposobnost korišćenja IIS veb servera (bazični principi, puštanje aplikacije u produkciju - deploy)","Poznavanje koncepata i tehnologija .NET MVC (Model View Controler), Razor, HTML Helpers, Data Annotation, Data Binding, Data Validation.","Sposobnost programiranja bazične web aplikacije koja koristi bazu podataka","Poznavanje osnovnih i jednog dela naprednih struktura JavaScript programskog jezika","Poznavanje osnovnih i jednog dela naprednih struktura JQuery","Sposobnost izrade kompetne veb aplikacije bazirane .NET MVC tehnologiji"]},{"name":"Modul 3. Napredno web programiranje","subjects":["Poznavanje koncepata i načina korišćenja Entity Framework","Poznavanje osnova objektno-relacionog mapiranja, Auto Mapper, LINQ","Scaffolding, Partial View","Poznavanje Dependency injection šablona","Poznavanje REST koncepata","Sposobnost izrade REST servisa korišćenjem ASP.NET Web API","Korišćenje Bootstrap biblioteke, Sorting, Pagination","AJAX, Ovladavanje single-page application (SPA) konceptom","Autorizacija i Autentifikacija, osnove OAuth principa"]}],"grading":"Na kraju svakog modula organizuje se poseban termin za ispit. Rezultati sa parcijalnih ispita nakon 1. i 2. modula ne utiču na sertifikaciju i služe kao informacija polazniku u kojoj meri je savladao gradivo. Nakon 3. modula organizuje se završni ispit, na osnovu kojeg se vrši sertifikacija.\n\nPo završetku kursa polaznicima se dodeljuje sertifikat o pohađanju ili uspešno završenom kursu, u zavisnosti od rezultata ostvarenog na završnom ispitu. Kurs je uspešno završen, ako polaznik na završnom ispitu ostvari najmanje 50% ukupno mogućih bodova (100).","image":"dotnet.png"},"name":"a","eMail":"a@a.com","tel":"a","address":"a","date":"2024-03-19T19:34:32.927Z"},{"name":"Dimitrije Krstic","courseId":"2","eMail":"dfrinky@gmail.com","tel":"0638275996","adress":"Dadaadad","course":{"id":2,"name":"Java Web Development","overview":"Ovo je intenzivni kurs namenjen onima koji žele da steknu kompetencije junior full stack developer-a za razvoj web aplikacija na Java platformi. Gradivo obuhvata razvoj serverskog dela web aplikacija upotrebom Java tehnologija i klijentskog dela web aplikacija korišćenjem React frameworka.","weeks":15,"classes":132,"classesPerWeek":12,"description":"Kurs je namenjen onima koji žele da steknu kompetencije junior full stack developer-a za razvoj web aplikacija na Java platformi. Polaznici koji uspešno završe kurs se preporučuju za poziv na selekciju za zaposlenje u kompanijama sa kojima FTN Informatika ima dogovor o saradnji. O kojim se kompanijama radi možete pogledati u sekciji Partneri.\n\nZa pohađanje kursa neophodno je da polaznici imaju predznanje iz osnova programiranja u nekom od programskih jezika visokog nivoa (Java, JavaScript, C++, C# i slično). Kao pomoć u proceni programerskih veština interesenata za kurs, organizujemo besplatna preliminarna testiranja. Ukoliko znate da nemate predznanje iz programiranja ili to ustanovite na preliminarnom testiranju, možete se opredeliti za pohađanje kursa Osnove programiranja, koji organizujemo kao pripremu za uspešno praćenje nastave na Java Web Development kursu.\n\nKurs Java Web Development je podeljen na tri modula: Osnove Java programiranja (modul 1), Osnove veb programiranja (modul 2) i Napredno veb programiranje (modul 3). Svaki termin nastave se sastoji iz kraćeg teoretskog dela, u kojem se polaznici upoznaju sa odgovarajućim konceptima i većeg broja primera i zadataka, kroz koje polaznici primenjuju naučene koncepte u praksi. Na kraju svakog predavanja polaznici dobijaju domaće zadatke, namenjene za utvrđivanje gradiva i sticanje samostalnosti u radu. Za polaznike kursa obezbeđen je računar, softver neophodan za realizaciju nastave i nastavni materijal u elektronskoj formi.","price":106800,"modules":[{"name":"Modul 1. Osnove Java Programiranja","subjects":["Korišćenje Eclipse okruženja","Poznavanje osnovnih koncepata objektnog programiranja (apstrakcija, generalizacija, polimorfizam)","Sposobnost programiranja osnovnih algoritamskih struktura","Sposobnost rada sa ulazom i izlazom (standardni ulaz/izlaz i fajl sistem)","Elementarni rad sa bazama podataka (osnove relacionog modela, SQL jezika i mehanizmi povezivanja Java aplikacije sa bazom podataka)","Korišćenje eksternih Java biblioteka","Korišćenje GIT sistema za kontrolu verzija programskog koda i timski rad","Korišćenje JUnit biblioteke za testiranje softvera"]},{"name":"Modul 2. Osnove web programiranja","subjects":["Poznavanje osnovnih i jednog dela naprednih HTML 4 i HTML 5 koncepata i struktura","Poznavanje osnovnih i jednog dela naprednih CSS koncepata i struktura","Korišćenje Eclipse java EE okruženja sa akcentom na segment za veb programiranje","Sposobnost korišćenja Apache Tomcat veb servera (bazični principi, puštanje aplikacije u produkciju - deploy)","Sposobnost korišćenja Maven alata za izgradnju tj. konstrukciju projekta kompleksnih aplikacija","Poznavanje koncepata i tehnologija Spring, Spring Boot, MVC (Model View Controler), Thymeleaf","Poznavanje Dependency injection i Inversion of Control šablona","Sposobnost programiranja bazične veb aplikacije koja koristi bazu podataka","Poznavanje osnovnih i jednog dela naprednih struktura JavaScript programskog jezika","Poznavanje osnovnih i jednog dela naprednih struktura Jquery i AJAX tehnologija","Sposobnost izrade kompetne veb aplikacije bazirane MVC arhitekturi"]},{"name":"Modul 3. Napredno web programiranje","subjects":["Poznavanje osnova objektno-relacionog mapiranja","Korišćenje Spring Data JPA uz Hibernate implementaciju","Osnove rada sa transakcijama","Poznavanje REST koncepata","Poznavanje sigurnosnih koncepata sa Spring Security","Autorizacija i Autentifikacija","Poznavanje Data Transfer Object koncepta","Sposobnost izrade REST servisa korišćenjem Spring frameworka","Poznavanje JavaScript-a i koncepata potrebnih za razumevanje React framework-a","Poznavanje ES6","Ovladavanje single-page application (SPA) konceptom","Korišćenje Bootstrap i Redux biblioteke, Sorting, Pagination","Korišćenje React frameworka za razvoj klijentskih front-end aplikacija (funkcijske komponente, klase, komponente, korišćenje JSX-a, properties, state, rutiranje, CRUD, asinhronost)"]}],"grading":"Na kraju svakog modula organizuje se poseban termin za ispit. Rezultati sa parcijalnih ispita nakon 1. i 2. modula ne utiču na sertifikaciju i služe kao informacija polazniku u kojoj meri je savladao gradivo. Nakon 3. modula organizuje se završni ispit, na osnovu kojeg se vrši sertifikacija.\n\nPo završetku kursa polaznicima se dodeljuje sertifikat o pohađanju ili uspešno završenom kursu, u zavisnosti od rezultata ostvarenog na završnom ispitu. Kurs je uspešno završen, ako polaznik na završnom ispitu ostvari najmanje 50% ukupno mogućih bodova (100).","image":"java.png"},"id":5,"date":"2024-05-19T18:43:25.632Z"},{"name":"Marina Rodic","courseId":"6","eMail":"marinarodic@gmail.com","tel":"0637646190","adress":"Moj dom 1","course":{"id":6,"name":"Android App Development","overview":"Ovo je intenzivni kurs namenjen onima koji žele da steknu kompetencije junior developer-a za razvoj Android aplikacija. Gradivo obuhvata osnove Java programiranja, baza podataka i razvoj mobilnih aplikacija na Android platformi.","weeks":12,"classes":120,"classesPerWeek":12,"description":"Kurs je namenjen onima koji žele da steknu kompetencije junior developer-a za razvoj mobilnih aplikacija na Android platformi. Polaznici koji uspešno završe kurs, preporučuju se za poziv na selekciju za zaposlenje u kompanijama sa kojima FTN Informatika ima dogovor o saradnji. O kojim se kompanijama radi možete pogledati u sekciji Partneri.\n\nZa pohađanje kursa neophodno je da polaznici imaju predznanje iz osnova programiranja u nekom od programskih jezika visokog nivoa (Java, C++, C#, JavaScripti slično). Kao pomoć u proceni programerskih veština interesenata za kurs, organizujemo besplatna preliminarna testiranja. Ukoliko znate da nemate predznanje iz programiranja ili to ustanovite na preliminarnom testiranju, možete se opredeliti za pohađanje kursa Osnove programiranja, koji organizujemo kao pripremu za uspešno praćenje nastave na Android app development kursu.\n\nKurs Android app development je podeljen na dva modula: Programski jezik Java (modul 1) i Android (modul 2). Svaki termin nastave se sastoji iz kraćeg teoretskog dela, u kojem se polaznici upoznaju sa odgovarajućim konceptima i većeg broja primera i zadataka, kroz koje polaznici primenjuju naučene koncepte u praksi. Na kraju svakog predavanja polaznici dobijaju domaće zadatke, namenjene za utvrđivanje gradiva i sticanje samostalnosti u radu. Za polaznike kursa obezbeđen je računar, tablet, softver neophodan za realizaciju nastave i nastavni materijal u elektronskoj formi.","price":106800,"modules":[{"name":"Modul 1. Programski jezik Java","subjects":["Osnove strukturiranog programiranja (sekvenca, selekcija, iteracija, funkcije)","Osnove objektnog programiranja (apstrakcija, generalizacija, asocijacija, agregacija, kompozicija, nasleđivanje, polimorfizam)","Osnove relacionih baza podataka (relacioni model podataka, SQL, objektno-relaciono mapiranje)","Osnove konkurentnog programiranja (niti, sinhronizacija niti)","Osnove alata za razvoj softvera (IntelliJ, Gradle, Git)"]},{"name":"Modul 2. Android","subjects":["Uvod u Android (Android platforma, Android komponente, struktura Android projekta, Android API, Android Studio i Android SDK)","Aktivnosti (osnove aktivnosti, definisanje aktivnosti, životni ciklus aktivnosti namere i filteri namera, startovanje aktivnosti, zadaci i povratni stek, upravljanje zadacima, osnove fragmenata, definisanje fragmenata, životni ciklus fragmenata)","GUI (XML, resursi, konfiguracije uređaja, UI šabloni, osnove pogleda, tipovi pogleda, osnove rasporeda, tipovi rasporeda, stilovi i teme, Material Design)","Servisi (asinhroni zadaci, osnove servisa, startovani i vezani servisi, definisanje servisa, životni ciklus servisa, startovanje servisa)","Dobavljači sadržaja (datoteke na Android platformi, deljena podešavanja, SQLite baza podataka, osnove dobavljača sadržaja, definisanje dobavljača sadržaja, ugrađeni dobavljači sadržaja, punjači)","Komunikacija (telefonija, SMS, mrežno programiranje, REST, JSON)","Lociranje i mape (osnove lociranja, Location API, osnove mapa, Maps API)","Senzori (osnove senzora, senzori pokreta, senzori pozicije, senzori okruženja)"]}],"grading":"Na kraju 2. modula organizuje se poseban termin za završni ispit, na osnovu kojeg se vrši sertifikacija.\n\nPo završetku kursa polaznicima se dodeljuje sertifikat o pohađanju ili uspešno završenom kursu, u zavisnosti od rezultata ostvarenog na završnom ispitu. Kurs je uspešno završen, ako polaznik na završnom ispitu ostvari najmanje 50% ukupno mogućih bodova (100).","image":"android.png"},"id":6,"date":"2024-05-19T18:52:59.762Z"},{"name":"Dimitrije Krstic","courseId":"1","eMail":"dfrinky@gmail.com","tel":"0638275996","adress":"Vec postoji prijava sa istim emailom","course":{"id":1,"name":"Osnove programiranja","overview":"Ovaj kurs namenjen je onima koji nemaju prethodnog iskustva u programiranju. Gradivo obuhvata osnove proceduralnog i objektnog programiranja korišćenjem programskog jezika Java. Na kursu možete steći predznanje, neophodno za uspešno praćenje nastave na naprednim kursevima programiranja. Uslov za pohađanje kursa je računarska pismenost, odnosno, poznavanje rada u Windows operativnom sistemu i sposobnost korištenja interneta.","weeks":7,"classes":36,"classesPerWeek":6,"description":"Kurs je namenjen onima koji žele da steknu predznanje iz osnova programiranja, neophodno za uspešno praćenje nastave na naprednim kursevima programiranja koje organizujemo (Java web development, Front-end web development, .NET Web Development, Test Development i Android Development kurs).\n\nSvaki termin nastave se sastoji iz kraćeg teoretskog dela, u kojem se polaznici upoznaju sa odgovarajućim konceptima, i većeg broja primera i zadataka, kroz koje polaznici primenjuju naučene koncepte u praksi. Na kraju svakog predavanja polaznici dobijaju domaće zadatke namenjene za utvrđivanje gradiva i sticanje samostalnosti u radu. Za polaznike kursa obezbeđen je računar, softver neophodan za realizaciju nastave i nastavni materijal u elektronskoj formi.","price":48000,"modules":[{"name":null,"subjects":["Korišćenje Eclipse okruženja","Poznavanje osnova Java sintakse - rad sa promenljivima, korišćenje aritmetičkih, relacionih i logičkih operatora","Sposobnost upravljanja tokom programa - poznavanje uslovnih izraza i rada sa ciklusima","Korišćenje funkcija","Sposobnost rada sa nizovima podataka","Sposobnost programiranja osnovnih algoritamskih struktura","Korišćenje ulazno - izlaznog podsistema iz Java programa","Poznavanje osnovnih koncepata objektnog programiranja"]}],"grading":"Na kraju kursa organizuje se završni ispit, koji obuhvata celokupno gradivo kursa. Po završetku kursa polaznicima se dodeljuje sertifikat o pohađanju ili uspešno završenom kursu, u zavisnosti od rezultata ostvarenog na završnom ispitu. Kurs je uspešno završen, ako polaznik na završnom ispitu ostvari najmanje 50% ukupno mogućih bodova (100).","image":"fundamentals.png"},"id":7,"date":"2024-05-19T18:54:29.989Z"},{"id":8,"course":{"id":2,"name":"Java Web Development","overview":"Ovo je intenzivni kurs namenjen onima koji žele da steknu kompetencije junior full stack developer-a za razvoj web aplikacija na Java platformi. Gradivo obuhvata razvoj serverskog dela web aplikacija upotrebom Java tehnologija i klijentskog dela web aplikacija korišćenjem React frameworka.","weeks":15,"classes":132,"classesPerWeek":12,"description":"Kurs je namenjen onima koji žele da steknu kompetencije junior full stack developer-a za razvoj web aplikacija na Java platformi. Polaznici koji uspešno završe kurs se preporučuju za poziv na selekciju za zaposlenje u kompanijama sa kojima FTN Informatika ima dogovor o saradnji. O kojim se kompanijama radi možete pogledati u sekciji Partneri.\n\nZa pohađanje kursa neophodno je da polaznici imaju predznanje iz osnova programiranja u nekom od programskih jezika visokog nivoa (Java, JavaScript, C++, C# i slično). Kao pomoć u proceni programerskih veština interesenata za kurs, organizujemo besplatna preliminarna testiranja. Ukoliko znate da nemate predznanje iz programiranja ili to ustanovite na preliminarnom testiranju, možete se opredeliti za pohađanje kursa Osnove programiranja, koji organizujemo kao pripremu za uspešno praćenje nastave na Java Web Development kursu.\n\nKurs Java Web Development je podeljen na tri modula: Osnove Java programiranja (modul 1), Osnove veb programiranja (modul 2) i Napredno veb programiranje (modul 3). Svaki termin nastave se sastoji iz kraćeg teoretskog dela, u kojem se polaznici upoznaju sa odgovarajućim konceptima i većeg broja primera i zadataka, kroz koje polaznici primenjuju naučene koncepte u praksi. Na kraju svakog predavanja polaznici dobijaju domaće zadatke, namenjene za utvrđivanje gradiva i sticanje samostalnosti u radu. Za polaznike kursa obezbeđen je računar, softver neophodan za realizaciju nastave i nastavni materijal u elektronskoj formi.","price":106800,"modules":[{"name":"Modul 1. Osnove Java Programiranja","subjects":["Korišćenje Eclipse okruženja","Poznavanje osnovnih koncepata objektnog programiranja (apstrakcija, generalizacija, polimorfizam)","Sposobnost programiranja osnovnih algoritamskih struktura","Sposobnost rada sa ulazom i izlazom (standardni ulaz/izlaz i fajl sistem)","Elementarni rad sa bazama podataka (osnove relacionog modela, SQL jezika i mehanizmi povezivanja Java aplikacije sa bazom podataka)","Korišćenje eksternih Java biblioteka","Korišćenje GIT sistema za kontrolu verzija programskog koda i timski rad","Korišćenje JUnit biblioteke za testiranje softvera"]},{"name":"Modul 2. Osnove web programiranja","subjects":["Poznavanje osnovnih i jednog dela naprednih HTML 4 i HTML 5 koncepata i struktura","Poznavanje osnovnih i jednog dela naprednih CSS koncepata i struktura","Korišćenje Eclipse java EE okruženja sa akcentom na segment za veb programiranje","Sposobnost korišćenja Apache Tomcat veb servera (bazični principi, puštanje aplikacije u produkciju - deploy)","Sposobnost korišćenja Maven alata za izgradnju tj. konstrukciju projekta kompleksnih aplikacija","Poznavanje koncepata i tehnologija Spring, Spring Boot, MVC (Model View Controler), Thymeleaf","Poznavanje Dependency injection i Inversion of Control šablona","Sposobnost programiranja bazične veb aplikacije koja koristi bazu podataka","Poznavanje osnovnih i jednog dela naprednih struktura JavaScript programskog jezika","Poznavanje osnovnih i jednog dela naprednih struktura Jquery i AJAX tehnologija","Sposobnost izrade kompetne veb aplikacije bazirane MVC arhitekturi"]},{"name":"Modul 3. Napredno web programiranje","subjects":["Poznavanje osnova objektno-relacionog mapiranja","Korišćenje Spring Data JPA uz Hibernate implementaciju","Osnove rada sa transakcijama","Poznavanje REST koncepata","Poznavanje sigurnosnih koncepata sa Spring Security","Autorizacija i Autentifikacija","Poznavanje Data Transfer Object koncepta","Sposobnost izrade REST servisa korišćenjem Spring frameworka","Poznavanje JavaScript-a i koncepata potrebnih za razumevanje React framework-a","Poznavanje ES6","Ovladavanje single-page application (SPA) konceptom","Korišćenje Bootstrap i Redux biblioteke, Sorting, Pagination","Korišćenje React frameworka za razvoj klijentskih front-end aplikacija (funkcijske komponente, klase, komponente, korišćenje JSX-a, properties, state, rutiranje, CRUD, asinhronost)"]}],"grading":"Na kraju svakog modula organizuje se poseban termin za ispit. Rezultati sa parcijalnih ispita nakon 1. i 2. modula ne utiču na sertifikaciju i služe kao informacija polazniku u kojoj meri je savladao gradivo. Nakon 3. modula organizuje se završni ispit, na osnovu kojeg se vrši sertifikacija.\n\nPo završetku kursa polaznicima se dodeljuje sertifikat o pohađanju ili uspešno završenom kursu, u zavisnosti od rezultata ostvarenog na završnom ispitu. Kurs je uspešno završen, ako polaznik na završnom ispitu ostvari najmanje 50% ukupno mogućih bodova (100).","image":"java.png"},"name":null,"eMail":"marinarodic@gmail.com","tel":"0637646190","address":"Moj dom 1","date":"2024-05-19T19:20:20.024Z"},{"id":9,"course":{"id":1,"name":"Osnove programiranja","overview":"Ovaj kurs namenjen je onima koji nemaju prethodnog iskustva u programiranju. Gradivo obuhvata osnove proceduralnog i objektnog programiranja korišćenjem programskog jezika Java. Na kursu možete steći predznanje, neophodno za uspešno praćenje nastave na naprednim kursevima programiranja. Uslov za pohađanje kursa je računarska pismenost, odnosno, poznavanje rada u Windows operativnom sistemu i sposobnost korištenja interneta.","weeks":7,"classes":36,"classesPerWeek":6,"description":"Kurs je namenjen onima koji žele da steknu predznanje iz osnova programiranja, neophodno za uspešno praćenje nastave na naprednim kursevima programiranja koje organizujemo (Java web development, Front-end web development, .NET Web Development, Test Development i Android Development kurs).\n\nSvaki termin nastave se sastoji iz kraćeg teoretskog dela, u kojem se polaznici upoznaju sa odgovarajućim konceptima, i većeg broja primera i zadataka, kroz koje polaznici primenjuju naučene koncepte u praksi. Na kraju svakog predavanja polaznici dobijaju domaće zadatke namenjene za utvrđivanje gradiva i sticanje samostalnosti u radu. Za polaznike kursa obezbeđen je računar, softver neophodan za realizaciju nastave i nastavni materijal u elektronskoj formi.","price":48000,"modules":[{"name":null,"subjects":["Korišćenje Eclipse okruženja","Poznavanje osnova Java sintakse - rad sa promenljivima, korišćenje aritmetičkih, relacionih i logičkih operatora","Sposobnost upravljanja tokom programa - poznavanje uslovnih izraza i rada sa ciklusima","Korišćenje funkcija","Sposobnost rada sa nizovima podataka","Sposobnost programiranja osnovnih algoritamskih struktura","Korišćenje ulazno - izlaznog podsistema iz Java programa","Poznavanje osnovnih koncepata objektnog programiranja"]}],"grading":"Na kraju kursa organizuje se završni ispit, koji obuhvata celokupno gradivo kursa. Po završetku kursa polaznicima se dodeljuje sertifikat o pohađanju ili uspešno završenom kursu, u zavisnosti od rezultata ostvarenog na završnom ispitu. Kurs je uspešno završen, ako polaznik na završnom ispitu ostvari najmanje 50% ukupno mogućih bodova (100).","image":"fundamentals.png"},"name":"Marina Rodic","eMail":"marinarodic@gmail.com","tel":"0637646190","address":"Moj dom 1","date":"2024-05-19T19:21:37.874Z"},{"id":10,"course":{"id":3,"name":".NET Web Development","overview":"Ovo je intenzivni kurs namenjen onima koji žele da steknu kompetencije junior full stack developer-a za razvoj web aplikacija na .NET platformi. Gradivo obuhvata razvoj serverskog dela web aplikacija upotrebom .NET tehnologija i klijentskog dela web aplikacija korišćenjem JavaScript jezika i pridruženih tehnologija.","weeks":15,"classes":132,"classesPerWeek":12,"description":"Kurs je namenjen onima koji žele da steknu kompetencije junior full stack developer-a za razvoj web aplikacija na .NET platformi. Polaznici koji uspešno završe kurs se preporučuju za poziv na selekciju za zaposlenje u kompanijama sa kojima FTN Informatika ima dogovor o saradnji. O kojim se kompanijama radi možete pogledati u sekciji Partneri.\n\nZa pohađanje kursa neophodno je da polaznici imaju predznanje iz osnova programiranja u nekom od programskih jezika visokog nivoa (C#, Java, JavaScript, C++ i slično). Kao pomoć u proceni programerskih veština interesenata za kurs, organizujemo besplatna preliminarna testiranja. Ukoliko znate da nemate predznanje iz programiranja ili to ustanovite na preliminarnom testiranju, možete se opredeliti za pohađanje kursa Osnove programiranja, koji organizujemo kao pripremu za uspešno praćenje nastave na .NET Web Development kursu.\n\nKurs .NET Web Development je podeljen na tri modula: Osnove C# programiranja (modul 1.), Osnove web programiranja (modul 2.) i Napredno web programiranje (modul 3.). Predavanja se sastoje iz kraćeg teoretskog dela, u kojem se polaznici upoznaju sa odgovarajućim konceptima i većeg broja zadataka, u kojima polaznici primenjuju naučene koncepte u praksi. Na kraju svakog predavanja polaznici dobijaju domaće zadatke, namenjene za utvrđivanje gradiva i sticanje samostalnosti u radu. Za svakog polaznika kursa obezbeđen je računar, softver neophodan za realizaciju nastave i nastavni materijal u elektronskoj formi.","price":106800,"modules":[{"name":"Modul 1. Osnove C# Programiranja","subjects":["Korišćenje Visual Studio okruženja","Poznavanje osnovnih koncepata objektnog programiranja (apstrakcija, generalizacija, polimorfizam)","Sposobnost programiranja osnovnih algoritamskih struktura i korišćenje funkcija","Sposobnost rada sa ulazom i izlazom (standardni ulaz/izlaz i fajl sistem)","Elementarni rad sa bazama podataka (osnove relacionog modela, SQL jezika i mehanizmi povezivanja C# aplikacije sa bazom podataka)","Korišćenje eksternih .NET biblioteka","Korišćenje GIT sistema za kontrolu verzija programskog koda","Korišćenje biblioteke za Unit testiranje softvera"]},{"name":"Modul 2. Osnove web programiranja","subjects":["Poznavanje osnovnih i jednog dela naprednih HTML 4 i HTML 5 koncepata i struktura","Poznavanje osnovnih i jednog dela naprednih CSS koncepata i struktura","Korišćenje Visual Studio okruženja sa akcentom na segment za web programiranje","Sposobnost korišćenja IIS veb servera (bazični principi, puštanje aplikacije u produkciju - deploy)","Poznavanje koncepata i tehnologija .NET MVC (Model View Controler), Razor, HTML Helpers, Data Annotation, Data Binding, Data Validation.","Sposobnost programiranja bazične web aplikacije koja koristi bazu podataka","Poznavanje osnovnih i jednog dela naprednih struktura JavaScript programskog jezika","Poznavanje osnovnih i jednog dela naprednih struktura JQuery","Sposobnost izrade kompetne veb aplikacije bazirane .NET MVC tehnologiji"]},{"name":"Modul 3. Napredno web programiranje","subjects":["Poznavanje koncepata i načina korišćenja Entity Framework","Poznavanje osnova objektno-relacionog mapiranja, Auto Mapper, LINQ","Scaffolding, Partial View","Poznavanje Dependency injection šablona","Poznavanje REST koncepata","Sposobnost izrade REST servisa korišćenjem ASP.NET Web API","Korišćenje Bootstrap biblioteke, Sorting, Pagination","AJAX, Ovladavanje single-page application (SPA) konceptom","Autorizacija i Autentifikacija, osnove OAuth principa"]}],"grading":"Na kraju svakog modula organizuje se poseban termin za ispit. Rezultati sa parcijalnih ispita nakon 1. i 2. modula ne utiču na sertifikaciju i služe kao informacija polazniku u kojoj meri je savladao gradivo. Nakon 3. modula organizuje se završni ispit, na osnovu kojeg se vrši sertifikacija.\n\nPo završetku kursa polaznicima se dodeljuje sertifikat o pohađanju ili uspešno završenom kursu, u zavisnosti od rezultata ostvarenog na završnom ispitu. Kurs je uspešno završen, ako polaznik na završnom ispitu ostvari najmanje 50% ukupno mogućih bodova (100).","image":"dotnet.png"},"name":"Dimitrije Krstic","eMail":"dfrinky@gmail.com","tel":"0638275996","address":"Dere","date":"2024-05-19T19:27:44.444Z"},{"id":11,"course":{"id":13,"name":"iOS App Development","overview":"Ovo je intenzivni kurs namenjen onima koji žele da steknu kompetencije junior developer-a za razvoj mobilnih aplikacija na iOS platformi. Na ovom kursu možete steći predznanje neophodno za uspešno praćenje nastave na Advanced iOS development kursu.","weeks":14,"classes":120,"classesPerWeek":12,"description":"Kurs je namenjen onima koji žele da steknu kompetencije junior developer-a za razvoj mobilnih aplikacija na iOS platformi. Na ovom kursu možete steći predznanje neophodno za uspešno praćenje nastave na Advanced iOS development kursu.\n\nKurs iOS app development je podeljen na dve logičke celine, odnosno, modula: Programski jezik Swift (modul 1) i Osnove razvoja aplikacija za iOS platformu (modul 2). Svaki termin nastave se sastoji iz kraćeg teoretskog dela, u kojem se polaznici upoznaju sa odgovarajućim konceptima i većeg broja primera i zadataka, kroz koje polaznici primenjuju naučene koncepte u praksi. Na kraju svakog predavanja polaznici dobijaju domaće zadatke, namenjene za utvrđivanje gradiva i sticanje samostalnosti u radu. Za polaznike kursa obezbeđen je računar, softver neophodan za realizaciju nastave i nastavni materijal u elektronskoj formi.","price":227000,"modules":[{"name":"Modul 1. Programski jezik Swift","subjects":["Osnove programskog jezika Swift:\n\n- Izrazi, promenjive, konstante, tipovi podataka, operacije\n\n- Kontrole toka izvršavanja programa\n\n- Napredne kontrole toka izvršavanja programa\n\n- Funkcije","Kolekcije u programskom jeziku Swift:\n\n- Liste, mape, setovi\n\n- Iteriranje kolekcija\n\n- Stringovi","Izvedeni tipovi podataka u programskom jeziku Swift:\n\n- Strukture\n\n- Klase\n\n- Svojstva\n\n- Metode\n\n- Napredne klase\n\n- Enumeracije","Napredni koncepti u programskom jeziku Swift:\n\n- Kontrola pristupa i organizacija koda\n\n- Rukovanje greškama\n\n- Rukovane memorijom\n\n- Protokoli\n\n- Generičko programiranje"]},{"name":"Modul 2. Osnove razvoja aplikacija za iOS platformu","subjects":["Xcode razvojno okuženje","Pregled iOS SDK (Software Development Kit):\n\n- Prikaz strukture iOS SDK (Cocoa Touch framework-a, Media, Core Services i Core OS)","MVC (Model-View-Controller) arhitektura za iOS","Pisanje kontrolera (UIViewController):\n\n- Kreiranje kontrolera\n\n- Startovanje kontrolera\n\n- Životni ciklus kontrolera\n\n- Veza između kontrolera i grafičkog korisničkog interfejsa\n\n- Praktične napomene za kontrolere","Rukovanje komponentama korisničkog interfejsa (GUI):\n\n- Rad sa osnovnim elementima korisničkog interfejsa: UIView, UIButton, UILabel, UITextField, UITextView, UISlider, UISwitch, ...\n\n- Praktične napomene za komponente korisničkog interfejsa","Rukovanje Navigacionim i TabBar kontrolerima:\n\n- Rad sa navigacionim kontrolerima (UINavigationController)\n\n- Rad sa TabBar kontrolerima (UITabbarController)\n\n- Praktične napomene za navigacione i TabBar kontrolere","Korišćenje AutoLayout i Storyboards:\n\n- Rad sa deklarativnim sistemom za pozicioniranje elemenata grafičkog korisničkog interfejsa (AutoLayout)\n\n- Rad sa vizuelnom reprezentacijom grafičkog korisničkog interfejsa (Storyboards)\n\n- Praktične napomene za AutoLayout i Storyboards","Kontejneri elemenata korisničnog interfejsa:\n\n- Rad sa UIScrollView komponentom\n\n- Rad sa UITableView komponentom\n\n- Rad sa UICollectionView komponentom\n\n- Rad sa UIStackView komponentom\n\n- Praktične apomene za kontejnere elemenata korisničnog interfejsa","Perzistencija podataka:\n\n- Rad sa lokalnom bazom podataka (NSUserDefaults)\n\n- Osnove CoreData framework-a\n\n- Praktične napomene za perzistovanje podataka","Mrežno programiranje (Networking):\n\n- Rad sa HTTP protokolom, REST, JSON"]}],"grading":"Na kraju svakog modula organizuje se poseban termin za ispit. Rezultati sa parcijalnog ispita nakon 1. modula ne utiču na sertifikaciju i služe kao informacija polazniku u kojoj meri je savladao gradivo. Nakon 2. modula organizuje se završni ispit, na osnovu kojeg se vrši sertifikacija.\n\nPo završetku kursa polaznicima se dodeljuje sertifikat o pohađanju ili uspešno završenom kursu, u zavisnosti od rezultata ostvarenog na završnom ispitu. Kurs je uspešno završen, ako polaznik na završnom ispitu ostvari najmanje 50% ukupno mogućih bodova (100).","image":"ios.png"},"name":"Bozidar ","eMail":"bozidar@hotmail.com","tel":"9284742721","address":"Dubisaurus","date":"2024-05-19T19:34:54.925Z"},{"id":12,"course":{"id":2,"name":"Java Web Development","overview":"Ovo je intenzivni kurs namenjen onima koji žele da steknu kompetencije junior full stack developer-a za razvoj web aplikacija na Java platformi. Gradivo obuhvata razvoj serverskog dela web aplikacija upotrebom Java tehnologija i klijentskog dela web aplikacija korišćenjem React frameworka.","weeks":15,"classes":132,"classesPerWeek":12,"description":"Kurs je namenjen onima koji žele da steknu kompetencije junior full stack developer-a za razvoj web aplikacija na Java platformi. Polaznici koji uspešno završe kurs se preporučuju za poziv na selekciju za zaposlenje u kompanijama sa kojima FTN Informatika ima dogovor o saradnji. O kojim se kompanijama radi možete pogledati u sekciji Partneri.\n\nZa pohađanje kursa neophodno je da polaznici imaju predznanje iz osnova programiranja u nekom od programskih jezika visokog nivoa (Java, JavaScript, C++, C# i slično). Kao pomoć u proceni programerskih veština interesenata za kurs, organizujemo besplatna preliminarna testiranja. Ukoliko znate da nemate predznanje iz programiranja ili to ustanovite na preliminarnom testiranju, možete se opredeliti za pohađanje kursa Osnove programiranja, koji organizujemo kao pripremu za uspešno praćenje nastave na Java Web Development kursu.\n\nKurs Java Web Development je podeljen na tri modula: Osnove Java programiranja (modul 1), Osnove veb programiranja (modul 2) i Napredno veb programiranje (modul 3). Svaki termin nastave se sastoji iz kraćeg teoretskog dela, u kojem se polaznici upoznaju sa odgovarajućim konceptima i većeg broja primera i zadataka, kroz koje polaznici primenjuju naučene koncepte u praksi. Na kraju svakog predavanja polaznici dobijaju domaće zadatke, namenjene za utvrđivanje gradiva i sticanje samostalnosti u radu. Za polaznike kursa obezbeđen je računar, softver neophodan za realizaciju nastave i nastavni materijal u elektronskoj formi.","price":106800,"modules":[{"name":"Modul 1. Osnove Java Programiranja","subjects":["Korišćenje Eclipse okruženja","Poznavanje osnovnih koncepata objektnog programiranja (apstrakcija, generalizacija, polimorfizam)","Sposobnost programiranja osnovnih algoritamskih struktura","Sposobnost rada sa ulazom i izlazom (standardni ulaz/izlaz i fajl sistem)","Elementarni rad sa bazama podataka (osnove relacionog modela, SQL jezika i mehanizmi povezivanja Java aplikacije sa bazom podataka)","Korišćenje eksternih Java biblioteka","Korišćenje GIT sistema za kontrolu verzija programskog koda i timski rad","Korišćenje JUnit biblioteke za testiranje softvera"]},{"name":"Modul 2. Osnove web programiranja","subjects":["Poznavanje osnovnih i jednog dela naprednih HTML 4 i HTML 5 koncepata i struktura","Poznavanje osnovnih i jednog dela naprednih CSS koncepata i struktura","Korišćenje Eclipse java EE okruženja sa akcentom na segment za veb programiranje","Sposobnost korišćenja Apache Tomcat veb servera (bazični principi, puštanje aplikacije u produkciju - deploy)","Sposobnost korišćenja Maven alata za izgradnju tj. konstrukciju projekta kompleksnih aplikacija","Poznavanje koncepata i tehnologija Spring, Spring Boot, MVC (Model View Controler), Thymeleaf","Poznavanje Dependency injection i Inversion of Control šablona","Sposobnost programiranja bazične veb aplikacije koja koristi bazu podataka","Poznavanje osnovnih i jednog dela naprednih struktura JavaScript programskog jezika","Poznavanje osnovnih i jednog dela naprednih struktura Jquery i AJAX tehnologija","Sposobnost izrade kompetne veb aplikacije bazirane MVC arhitekturi"]},{"name":"Modul 3. Napredno web programiranje","subjects":["Poznavanje osnova objektno-relacionog mapiranja","Korišćenje Spring Data JPA uz Hibernate implementaciju","Osnove rada sa transakcijama","Poznavanje REST koncepata","Poznavanje sigurnosnih koncepata sa Spring Security","Autorizacija i Autentifikacija","Poznavanje Data Transfer Object koncepta","Sposobnost izrade REST servisa korišćenjem Spring frameworka","Poznavanje JavaScript-a i koncepata potrebnih za razumevanje React framework-a","Poznavanje ES6","Ovladavanje single-page application (SPA) konceptom","Korišćenje Bootstrap i Redux biblioteke, Sorting, Pagination","Korišćenje React frameworka za razvoj klijentskih front-end aplikacija (funkcijske komponente, klase, komponente, korišćenje JSX-a, properties, state, rutiranje, CRUD, asinhronost)"]}],"grading":"Na kraju svakog modula organizuje se poseban termin za ispit. Rezultati sa parcijalnih ispita nakon 1. i 2. modula ne utiču na sertifikaciju i služe kao informacija polazniku u kojoj meri je savladao gradivo. Nakon 3. modula organizuje se završni ispit, na osnovu kojeg se vrši sertifikacija.\n\nPo završetku kursa polaznicima se dodeljuje sertifikat o pohađanju ili uspešno završenom kursu, u zavisnosti od rezultata ostvarenog na završnom ispitu. Kurs je uspešno završen, ako polaznik na završnom ispitu ostvari najmanje 50% ukupno mogućih bodova (100).","image":"java.png"},"name":"DEmilarijus","eMail":"demi@gmail.com","tel":"9292178489","address":"BombA Rasta!","date":"2024-05-19T19:38:57.706Z"},{"id":13,"course":{"id":14,"name":"Advanced iOS Development","overview":"Ovo je intenzivni kurs namenjen onima koji žele da steknu kompetencije medior developer-a za razvoj mobilnih aplikacija na iOS platformi.","weeks":14,"classes":120,"classesPerWeek":12,"description":"Kurs je namenjen onima koji žele da steknu kompetencije medior developer-a za razvoj mobilnih aplikacija na iOS platformi\n\nKurs Advanced iOS development je podeljen na dva modula: Napredni koncepti programskog jezika Swift (modul 1) i Napredne tehnike razvoja aplikacija za iOS platformu (modul 2). Svaki termin nastave se sastoji iz kraćeg teoretskog dela, u kojem se polaznici upoznaju sa odgovarajućim konceptima i većeg broja primera i zadataka, kroz koje polaznici primenjuju naučene koncepte u praksi. Na kraju svakog predavanja polaznici dobijaju domaće zadatke, namenjene za utvrđivanje gradiva i sticanje samostalnosti u radu. Za polaznike kursa obezbeđen je računar, softver neophodan za realizaciju nastave i nastavni materijal u elektronskoj formi.","price":227000,"modules":[{"name":"Modul 1. Napredni koncepti programskog jezika Swift","subjects":["Napredni koncepti Swift-a: Extensions, Subscripts, Advanced Operators, Generics","Funkcionalno programiranje u Swift-u","Protokol-orijentisano programiranje u Swift-u","Dizajn šabloni u Swift-u: Delegation, KVO, Observer, Notification, State, Facade, Factory, Memento, Strategy","Tehnike za obradu grešaka","Napredno upravljanje memorijom","Dobra praksa u Swift-u i preporuke za stil"]},{"name":"Modul 2. Napredne tehnike razvoja aplikacija za iOS platformu","subjects":["Advanced Core Data","Advanced Auto Layout","iOS Architectures - MVC - Pros & Cons","iOS Architectures - MVVM - Pros & Cons","iOS Architectures - VIPER - Pros & Cons","iOS Architectures - VIP (Clean Swift) - Pros & Cons","iOS Architectures - Coordinators & Flow Controllers","Unit testing","UI testing","Xcode - tips & tricks","Xcode debugging - tips & tricks"]}],"grading":"Na kraju svakog modula organizuje se poseban termin za ispit. Rezultati sa parcijalnog ispita nakon 1. modula ne utiču na sertifikaciju i služe kao informacija polazniku u kojoj meri je savladao gradivo. Nakon 2. modula organizuje se završni ispit, na osnovu kojeg se vrši sertifikacija.\n\nPo završetku kursa polaznicima se dodeljuje sertifikat o pohađanju ili uspešno završenom kursu, u zavisnosti od rezultata ostvarenog na završnom ispitu. Kurs je uspešno završen, ako polaznik na završnom ispitu ostvari najmanje 50% ukupno mogućih bodova (100).","image":"ios2.png"},"name":"Dimitrije Krstic","eMail":"dfrinky@gmail.com","tel":"0638275996","address":"Somborska 16","date":"2024-05-19T19:51:28.307Z"},{"id":15,"course":{"id":1,"name":"Osnove programiranja","overview":"Ovaj kurs namenjen je onima koji nemaju prethodnog iskustva u programiranju. Gradivo obuhvata osnove proceduralnog i objektnog programiranja korišćenjem programskog jezika Java. Na kursu možete steći predznanje, neophodno za uspešno praćenje nastave na naprednim kursevima programiranja. Uslov za pohađanje kursa je računarska pismenost, odnosno, poznavanje rada u Windows operativnom sistemu i sposobnost korištenja interneta.","weeks":7,"classes":36,"classesPerWeek":6,"description":"Kurs je namenjen onima koji žele da steknu predznanje iz osnova programiranja, neophodno za uspešno praćenje nastave na naprednim kursevima programiranja koje organizujemo (Java web development, Front-end web development, .NET Web Development, Test Development i Android Development kurs).\n\nSvaki termin nastave se sastoji iz kraćeg teoretskog dela, u kojem se polaznici upoznaju sa odgovarajućim konceptima, i većeg broja primera i zadataka, kroz koje polaznici primenjuju naučene koncepte u praksi. Na kraju svakog predavanja polaznici dobijaju domaće zadatke namenjene za utvrđivanje gradiva i sticanje samostalnosti u radu. Za polaznike kursa obezbeđen je računar, softver neophodan za realizaciju nastave i nastavni materijal u elektronskoj formi.","price":48000,"modules":[{"name":null,"subjects":["Korišćenje Eclipse okruženja","Poznavanje osnova Java sintakse - rad sa promenljivima, korišćenje aritmetičkih, relacionih i logičkih operatora","Sposobnost upravljanja tokom programa - poznavanje uslovnih izraza i rada sa ciklusima","Korišćenje funkcija","Sposobnost rada sa nizovima podataka","Sposobnost programiranja osnovnih algoritamskih struktura","Korišćenje ulazno - izlaznog podsistema iz Java programa","Poznavanje osnovnih koncepata objektnog programiranja"]}],"grading":"Na kraju kursa organizuje se završni ispit, koji obuhvata celokupno gradivo kursa. Po završetku kursa polaznicima se dodeljuje sertifikat o pohađanju ili uspešno završenom kursu, u zavisnosti od rezultata ostvarenog na završnom ispitu. Kurs je uspešno završen, ako polaznik na završnom ispitu ostvari najmanje 50% ukupno mogućih bodova (100).","image":"fundamentals.png"},"name":"Drazen","eMail":"dra@zen.com","tel":"289448319284938","address":"Boro","date":"2024-05-19T19:53:46.417Z"},{"id":16,"course":{"id":1,"name":"Osnove programiranja","overview":"Ovaj kurs namenjen je onima koji nemaju prethodnog iskustva u programiranju. Gradivo obuhvata osnove proceduralnog i objektnog programiranja korišćenjem programskog jezika Java. Na kursu možete steći predznanje, neophodno za uspešno praćenje nastave na naprednim kursevima programiranja. Uslov za pohađanje kursa je računarska pismenost, odnosno, poznavanje rada u Windows operativnom sistemu i sposobnost korištenja interneta.","weeks":7,"classes":36,"classesPerWeek":6,"description":"Kurs je namenjen onima koji žele da steknu predznanje iz osnova programiranja, neophodno za uspešno praćenje nastave na naprednim kursevima programiranja koje organizujemo (Java web development, Front-end web development, .NET Web Development, Test Development i Android Development kurs).\n\nSvaki termin nastave se sastoji iz kraćeg teoretskog dela, u kojem se polaznici upoznaju sa odgovarajućim konceptima, i većeg broja primera i zadataka, kroz koje polaznici primenjuju naučene koncepte u praksi. Na kraju svakog predavanja polaznici dobijaju domaće zadatke namenjene za utvrđivanje gradiva i sticanje samostalnosti u radu. Za polaznike kursa obezbeđen je računar, softver neophodan za realizaciju nastave i nastavni materijal u elektronskoj formi.","price":48000,"modules":[{"name":null,"subjects":["Korišćenje Eclipse okruženja","Poznavanje osnova Java sintakse - rad sa promenljivima, korišćenje aritmetičkih, relacionih i logičkih operatora","Sposobnost upravljanja tokom programa - poznavanje uslovnih izraza i rada sa ciklusima","Korišćenje funkcija","Sposobnost rada sa nizovima podataka","Sposobnost programiranja osnovnih algoritamskih struktura","Korišćenje ulazno - izlaznog podsistema iz Java programa","Poznavanje osnovnih koncepata objektnog programiranja"]}],"grading":"Na kraju kursa organizuje se završni ispit, koji obuhvata celokupno gradivo kursa. Po završetku kursa polaznicima se dodeljuje sertifikat o pohađanju ili uspešno završenom kursu, u zavisnosti od rezultata ostvarenog na završnom ispitu. Kurs je uspešno završen, ako polaznik na završnom ispitu ostvari najmanje 50% ukupno mogućih bodova (100).","image":"fundamentals.png"},"name":"Dimitrije Krstic","eMail":"dfrinky2@gmail.com","tel":"0638275996","address":"Dadaad","date":"2024-05-19T19:54:22.097Z"},{"id":17,"course":{"id":7,"name":"Embedded Software Development","overview":"Ovo je intenzivni kurs namenjen onima koji žele da steknu kompetencije junior software developera za razvoj embedded sistema (automotive industrija, smart home sistemi, potrošačka elektronika, itd.). Gradivo obuhvata osnovno i napredno programiranje u programskom jeziku C, programiranje mikrokontrolera, upotrebu operativnih sistema za rad u realnom vremenu, kao i izradu aplikacija za napredne embedded sisteme.","weeks":15,"classes":120,"classesPerWeek":12,"description":"Kurs Embedded software development namenjen je onima koji žele da steknu kompetencije junior software developera za razvoj embedded sistema.\n\nZa pohađanje kursa poželjno je da polaznici poseduju odgovarajuća predznanja iz programiranja u nekom od programskih jezika srednjeg ili visokog nivoa (C, Java, C++, C# i slično). Kao pomoć u proceni programerskih veština interesenata za kurs, organizujemo besplatna preliminarna testiranja. Ukoliko znate da nemate predznanje iz programiranja ili to ustanovite na preliminarnom testiranju, možete se opredeliti za pohađanje kursa Osnove programiranja, koji organizujemo kao pripremu za uspešno praćenje nastave na Embedded Software Development kursu.\n\nKurs Embedded Software Development podeljen je na tri modula: Osnovno i napredno programiranje u programskom jeziku C (modul 1), Osnove pisanja softvera za embedded sisteme (modul 2) i Razvoj naprednih embedded sistema (modul 3). Svaki termin nastave sastoji se iz kraćeg teoretskog dela, u kojem se polaznici upoznaju sa odgovarajućim konceptima, i većeg broja primera i zadataka, kroz koje polaznici primenjuju naučene koncepte u praksi. Na kraju svakog predavanja polaznici dobijaju domaće zadatke namenjene utvrđivanju gradiva i sticanju samostalnosti u radu.\n\nZa polaznike kursa obezbeđen je računar, softver neophodan za realizaciju nastave i nastavni materijal u elektronskoj formi. Pored navedenog, svakom polazniku je obezbeđena i oprema u vidu razvojnog sistema EK-TM4C123GXL i kompleta senzora, koju polaznici koriste za razvoj aplikacija tokom kursa i zadržavaju nakon završetka (cena opreme je uključena u cenu kursa).","price":120000,"modules":[{"name":"Programiranje u programskom jeziku C","subjects":["Osnovni i napredni koncepti proceduralnog programiranja u programskom jezika C","Rad sa Code Composer Studio alatom za pisanje softvera","Korišćenje alata za kompajliranje i analizu rada programa na sistemu EK-TM4C123GXL","Napredan rad sa memorijom računara","Korišćenje Git sistema za kontrolu verzija i timski rad"]},{"name":"Osnove embedded sistema","subjects":["Osnovna struktura i namena embedded sistema","Pisanje softvera za embedded sisteme i mikrokontrolere","Osnovne periferije mikrokontrolera (GPIO, tajmeri, EEPROM, PWM, ADC/DCA, watchdog)","Rad sa prekidima mikrokontrolera","Osnove hardvera embedded sistema","Elementi embedded sistema","Osnovni algoritmi embedded softvera"]},{"name":"Razvoj naprednih embedded sistema","subjects":["Komunikacione tehnologije (SPI, UART, I2C)","Režimi rada embedded sistema i mikrokontrolera","Metodologije i procesi razvoja embedded sistema","Osnove testiranja embedded sistema","Sistemi namenjeni za rad u realnom vremenu","Operativni sistemi (FreeRTOS, Linux)","Automotive tehnologije (CAN, LIN, AUTOSAR)"]}],"grading":"Na kraju svakog modula organizuje se poseban termin za ispit. Rezultati sa parcijalnih ispita nakon 1. i 2. modula ne utiču na sertifikaciju i služe kao informacija polazniku u kojoj meri je savladao gradivo određenog modula. Nakon 3. modula organizuje se završni ispit, na osnovu kojeg se vrši sertifikacija.\n\nPo završetku kursa polaznicima se dodeljuje sertifikat o pohađanju ili uspešno završenom kursu, u zavisnosti od rezultata ostvarenog na završnom ispitu. Kurs je uspešno završen, ako polaznik na završnom ispitu ostvari najmanje 50% ukupno mogućih bodova (100).","image":"embeded.png"},"name":"Funda","eMail":"menta@list.com","tel":"420940294","address":"Dobana Hucica","date":"2024-05-20T10:20:32.255Z"},{"id":18,"course":{"id":7,"name":"Embedded Software Development","overview":"Ovo je intenzivni kurs namenjen onima koji žele da steknu kompetencije junior software developera za razvoj embedded sistema (automotive industrija, smart home sistemi, potrošačka elektronika, itd.). Gradivo obuhvata osnovno i napredno programiranje u programskom jeziku C, programiranje mikrokontrolera, upotrebu operativnih sistema za rad u realnom vremenu, kao i izradu aplikacija za napredne embedded sisteme.","weeks":15,"classes":120,"classesPerWeek":12,"description":"Kurs Embedded software development namenjen je onima koji žele da steknu kompetencije junior software developera za razvoj embedded sistema.\n\nZa pohađanje kursa poželjno je da polaznici poseduju odgovarajuća predznanja iz programiranja u nekom od programskih jezika srednjeg ili visokog nivoa (C, Java, C++, C# i slično). Kao pomoć u proceni programerskih veština interesenata za kurs, organizujemo besplatna preliminarna testiranja. Ukoliko znate da nemate predznanje iz programiranja ili to ustanovite na preliminarnom testiranju, možete se opredeliti za pohađanje kursa Osnove programiranja, koji organizujemo kao pripremu za uspešno praćenje nastave na Embedded Software Development kursu.\n\nKurs Embedded Software Development podeljen je na tri modula: Osnovno i napredno programiranje u programskom jeziku C (modul 1), Osnove pisanja softvera za embedded sisteme (modul 2) i Razvoj naprednih embedded sistema (modul 3). Svaki termin nastave sastoji se iz kraćeg teoretskog dela, u kojem se polaznici upoznaju sa odgovarajućim konceptima, i većeg broja primera i zadataka, kroz koje polaznici primenjuju naučene koncepte u praksi. Na kraju svakog predavanja polaznici dobijaju domaće zadatke namenjene utvrđivanju gradiva i sticanju samostalnosti u radu.\n\nZa polaznike kursa obezbeđen je računar, softver neophodan za realizaciju nastave i nastavni materijal u elektronskoj formi. Pored navedenog, svakom polazniku je obezbeđena i oprema u vidu razvojnog sistema EK-TM4C123GXL i kompleta senzora, koju polaznici koriste za razvoj aplikacija tokom kursa i zadržavaju nakon završetka (cena opreme je uključena u cenu kursa).","price":120000,"modules":[{"name":"Programiranje u programskom jeziku C","subjects":["Osnovni i napredni koncepti proceduralnog programiranja u programskom jezika C","Rad sa Code Composer Studio alatom za pisanje softvera","Korišćenje alata za kompajliranje i analizu rada programa na sistemu EK-TM4C123GXL","Napredan rad sa memorijom računara","Korišćenje Git sistema za kontrolu verzija i timski rad"]},{"name":"Osnove embedded sistema","subjects":["Osnovna struktura i namena embedded sistema","Pisanje softvera za embedded sisteme i mikrokontrolere","Osnovne periferije mikrokontrolera (GPIO, tajmeri, EEPROM, PWM, ADC/DCA, watchdog)","Rad sa prekidima mikrokontrolera","Osnove hardvera embedded sistema","Elementi embedded sistema","Osnovni algoritmi embedded softvera"]},{"name":"Razvoj naprednih embedded sistema","subjects":["Komunikacione tehnologije (SPI, UART, I2C)","Režimi rada embedded sistema i mikrokontrolera","Metodologije i procesi razvoja embedded sistema","Osnove testiranja embedded sistema","Sistemi namenjeni za rad u realnom vremenu","Operativni sistemi (FreeRTOS, Linux)","Automotive tehnologije (CAN, LIN, AUTOSAR)"]}],"grading":"Na kraju svakog modula organizuje se poseban termin za ispit. Rezultati sa parcijalnih ispita nakon 1. i 2. modula ne utiču na sertifikaciju i služe kao informacija polazniku u kojoj meri je savladao gradivo određenog modula. Nakon 3. modula organizuje se završni ispit, na osnovu kojeg se vrši sertifikacija.\n\nPo završetku kursa polaznicima se dodeljuje sertifikat o pohađanju ili uspešno završenom kursu, u zavisnosti od rezultata ostvarenog na završnom ispitu. Kurs je uspešno završen, ako polaznik na završnom ispitu ostvari najmanje 50% ukupno mogućih bodova (100).","image":"embeded.png"},"name":"Drazen","eMail":"menta2@list.com","tel":"828282828","address":"Doktor","date":"2024-05-20T11:10:18.820Z"},{"id":19,"course":{"id":7,"name":"Embedded Software Development","overview":"Ovo je intenzivni kurs namenjen onima koji žele da steknu kompetencije junior software developera za razvoj embedded sistema (automotive industrija, smart home sistemi, potrošačka elektronika, itd.). Gradivo obuhvata osnovno i napredno programiranje u programskom jeziku C, programiranje mikrokontrolera, upotrebu operativnih sistema za rad u realnom vremenu, kao i izradu aplikacija za napredne embedded sisteme.","weeks":15,"classes":120,"classesPerWeek":12,"description":"Kurs Embedded software development namenjen je onima koji žele da steknu kompetencije junior software developera za razvoj embedded sistema.\n\nZa pohađanje kursa poželjno je da polaznici poseduju odgovarajuća predznanja iz programiranja u nekom od programskih jezika srednjeg ili visokog nivoa (C, Java, C++, C# i slično). Kao pomoć u proceni programerskih veština interesenata za kurs, organizujemo besplatna preliminarna testiranja. Ukoliko znate da nemate predznanje iz programiranja ili to ustanovite na preliminarnom testiranju, možete se opredeliti za pohađanje kursa Osnove programiranja, koji organizujemo kao pripremu za uspešno praćenje nastave na Embedded Software Development kursu.\n\nKurs Embedded Software Development podeljen je na tri modula: Osnovno i napredno programiranje u programskom jeziku C (modul 1), Osnove pisanja softvera za embedded sisteme (modul 2) i Razvoj naprednih embedded sistema (modul 3). Svaki termin nastave sastoji se iz kraćeg teoretskog dela, u kojem se polaznici upoznaju sa odgovarajućim konceptima, i većeg broja primera i zadataka, kroz koje polaznici primenjuju naučene koncepte u praksi. Na kraju svakog predavanja polaznici dobijaju domaće zadatke namenjene utvrđivanju gradiva i sticanju samostalnosti u radu.\n\nZa polaznike kursa obezbeđen je računar, softver neophodan za realizaciju nastave i nastavni materijal u elektronskoj formi. Pored navedenog, svakom polazniku je obezbeđena i oprema u vidu razvojnog sistema EK-TM4C123GXL i kompleta senzora, koju polaznici koriste za razvoj aplikacija tokom kursa i zadržavaju nakon završetka (cena opreme je uključena u cenu kursa).","price":120000,"modules":[{"name":"Programiranje u programskom jeziku C","subjects":["Osnovni i napredni koncepti proceduralnog programiranja u programskom jezika C","Rad sa Code Composer Studio alatom za pisanje softvera","Korišćenje alata za kompajliranje i analizu rada programa na sistemu EK-TM4C123GXL","Napredan rad sa memorijom računara","Korišćenje Git sistema za kontrolu verzija i timski rad"]},{"name":"Osnove embedded sistema","subjects":["Osnovna struktura i namena embedded sistema","Pisanje softvera za embedded sisteme i mikrokontrolere","Osnovne periferije mikrokontrolera (GPIO, tajmeri, EEPROM, PWM, ADC/DCA, watchdog)","Rad sa prekidima mikrokontrolera","Osnove hardvera embedded sistema","Elementi embedded sistema","Osnovni algoritmi embedded softvera"]},{"name":"Razvoj naprednih embedded sistema","subjects":["Komunikacione tehnologije (SPI, UART, I2C)","Režimi rada embedded sistema i mikrokontrolera","Metodologije i procesi razvoja embedded sistema","Osnove testiranja embedded sistema","Sistemi namenjeni za rad u realnom vremenu","Operativni sistemi (FreeRTOS, Linux)","Automotive tehnologije (CAN, LIN, AUTOSAR)"]}],"grading":"Na kraju svakog modula organizuje se poseban termin za ispit. Rezultati sa parcijalnih ispita nakon 1. i 2. modula ne utiču na sertifikaciju i služe kao informacija polazniku u kojoj meri je savladao gradivo određenog modula. Nakon 3. modula organizuje se završni ispit, na osnovu kojeg se vrši sertifikacija.\n\nPo završetku kursa polaznicima se dodeljuje sertifikat o pohađanju ili uspešno završenom kursu, u zavisnosti od rezultata ostvarenog na završnom ispitu. Kurs je uspešno završen, ako polaznik na završnom ispitu ostvari najmanje 50% ukupno mogućih bodova (100).","image":"embeded.png"},"name":"Drago","eMail":"menta23@list.com","tel":"8282882","address":"Mur","date":"2024-05-20T11:21:06.788Z"},{"id":20,"course":{"id":2,"name":"Java Web Development","overview":"Ovo je intenzivni kurs namenjen onima koji žele da steknu kompetencije junior full stack developer-a za razvoj web aplikacija na Java platformi. Gradivo obuhvata razvoj serverskog dela web aplikacija upotrebom Java tehnologija i klijentskog dela web aplikacija korišćenjem React frameworka.","weeks":15,"classes":132,"classesPerWeek":12,"description":"Kurs je namenjen onima koji žele da steknu kompetencije junior full stack developer-a za razvoj web aplikacija na Java platformi. Polaznici koji uspešno završe kurs se preporučuju za poziv na selekciju za zaposlenje u kompanijama sa kojima FTN Informatika ima dogovor o saradnji. O kojim se kompanijama radi možete pogledati u sekciji Partneri.\n\nZa pohađanje kursa neophodno je da polaznici imaju predznanje iz osnova programiranja u nekom od programskih jezika visokog nivoa (Java, JavaScript, C++, C# i slično). Kao pomoć u proceni programerskih veština interesenata za kurs, organizujemo besplatna preliminarna testiranja. Ukoliko znate da nemate predznanje iz programiranja ili to ustanovite na preliminarnom testiranju, možete se opredeliti za pohađanje kursa Osnove programiranja, koji organizujemo kao pripremu za uspešno praćenje nastave na Java Web Development kursu.\n\nKurs Java Web Development je podeljen na tri modula: Osnove Java programiranja (modul 1), Osnove veb programiranja (modul 2) i Napredno veb programiranje (modul 3). Svaki termin nastave se sastoji iz kraćeg teoretskog dela, u kojem se polaznici upoznaju sa odgovarajućim konceptima i većeg broja primera i zadataka, kroz koje polaznici primenjuju naučene koncepte u praksi. Na kraju svakog predavanja polaznici dobijaju domaće zadatke, namenjene za utvrđivanje gradiva i sticanje samostalnosti u radu. Za polaznike kursa obezbeđen je računar, softver neophodan za realizaciju nastave i nastavni materijal u elektronskoj formi.","price":106800,"modules":[{"name":"Modul 1. Osnove Java Programiranja","subjects":["Korišćenje Eclipse okruženja","Poznavanje osnovnih koncepata objektnog programiranja (apstrakcija, generalizacija, polimorfizam)","Sposobnost programiranja osnovnih algoritamskih struktura","Sposobnost rada sa ulazom i izlazom (standardni ulaz/izlaz i fajl sistem)","Elementarni rad sa bazama podataka (osnove relacionog modela, SQL jezika i mehanizmi povezivanja Java aplikacije sa bazom podataka)","Korišćenje eksternih Java biblioteka","Korišćenje GIT sistema za kontrolu verzija programskog koda i timski rad","Korišćenje JUnit biblioteke za testiranje softvera"]},{"name":"Modul 2. Osnove web programiranja","subjects":["Poznavanje osnovnih i jednog dela naprednih HTML 4 i HTML 5 koncepata i struktura","Poznavanje osnovnih i jednog dela naprednih CSS koncepata i struktura","Korišćenje Eclipse java EE okruženja sa akcentom na segment za veb programiranje","Sposobnost korišćenja Apache Tomcat veb servera (bazični principi, puštanje aplikacije u produkciju - deploy)","Sposobnost korišćenja Maven alata za izgradnju tj. konstrukciju projekta kompleksnih aplikacija","Poznavanje koncepata i tehnologija Spring, Spring Boot, MVC (Model View Controler), Thymeleaf","Poznavanje Dependency injection i Inversion of Control šablona","Sposobnost programiranja bazične veb aplikacije koja koristi bazu podataka","Poznavanje osnovnih i jednog dela naprednih struktura JavaScript programskog jezika","Poznavanje osnovnih i jednog dela naprednih struktura Jquery i AJAX tehnologija","Sposobnost izrade kompetne veb aplikacije bazirane MVC arhitekturi"]},{"name":"Modul 3. Napredno web programiranje","subjects":["Poznavanje osnova objektno-relacionog mapiranja","Korišćenje Spring Data JPA uz Hibernate implementaciju","Osnove rada sa transakcijama","Poznavanje REST koncepata","Poznavanje sigurnosnih koncepata sa Spring Security","Autorizacija i Autentifikacija","Poznavanje Data Transfer Object koncepta","Sposobnost izrade REST servisa korišćenjem Spring frameworka","Poznavanje JavaScript-a i koncepata potrebnih za razumevanje React framework-a","Poznavanje ES6","Ovladavanje single-page application (SPA) konceptom","Korišćenje Bootstrap i Redux biblioteke, Sorting, Pagination","Korišćenje React frameworka za razvoj klijentskih front-end aplikacija (funkcijske komponente, klase, komponente, korišćenje JSX-a, properties, state, rutiranje, CRUD, asinhronost)"]}],"grading":"Na kraju svakog modula organizuje se poseban termin za ispit. Rezultati sa parcijalnih ispita nakon 1. i 2. modula ne utiču na sertifikaciju i služe kao informacija polazniku u kojoj meri je savladao gradivo. Nakon 3. modula organizuje se završni ispit, na osnovu kojeg se vrši sertifikacija.\n\nPo završetku kursa polaznicima se dodeljuje sertifikat o pohađanju ili uspešno završenom kursu, u zavisnosti od rezultata ostvarenog na završnom ispitu. Kurs je uspešno završen, ako polaznik na završnom ispitu ostvari najmanje 50% ukupno mogućih bodova (100).","image":"java.png"},"name":"Jan Struhar","eMail":"struhar.jan@gmail.com","tel":"067899677","address":"Backi petrovac 123","date":"2024-05-24T15:50:25.219Z"},{"id":21,"course":{"id":1,"name":"Osnove programiranja","overview":"Ovaj kurs namenjen je onima koji nemaju prethodnog iskustva u programiranju. Gradivo obuhvata osnove proceduralnog i objektnog programiranja korišćenjem programskog jezika Java. Na kursu možete steći predznanje, neophodno za uspešno praćenje nastave na naprednim kursevima programiranja. Uslov za pohađanje kursa je računarska pismenost, odnosno, poznavanje rada u Windows operativnom sistemu i sposobnost korištenja interneta.","weeks":7,"classes":36,"classesPerWeek":6,"description":"Kurs je namenjen onima koji žele da steknu predznanje iz osnova programiranja, neophodno za uspešno praćenje nastave na naprednim kursevima programiranja koje organizujemo (Java web development, Front-end web development, .NET Web Development, Test Development i Android Development kurs).\n\nSvaki termin nastave se sastoji iz kraćeg teoretskog dela, u kojem se polaznici upoznaju sa odgovarajućim konceptima, i većeg broja primera i zadataka, kroz koje polaznici primenjuju naučene koncepte u praksi. Na kraju svakog predavanja polaznici dobijaju domaće zadatke namenjene za utvrđivanje gradiva i sticanje samostalnosti u radu. Za polaznike kursa obezbeđen je računar, softver neophodan za realizaciju nastave i nastavni materijal u elektronskoj formi.","price":48000,"modules":[{"name":null,"subjects":["Korišćenje Eclipse okruženja","Poznavanje osnova Java sintakse - rad sa promenljivima, korišćenje aritmetičkih, relacionih i logičkih operatora","Sposobnost upravljanja tokom programa - poznavanje uslovnih izraza i rada sa ciklusima","Korišćenje funkcija","Sposobnost rada sa nizovima podataka","Sposobnost programiranja osnovnih algoritamskih struktura","Korišćenje ulazno - izlaznog podsistema iz Java programa","Poznavanje osnovnih koncepata objektnog programiranja"]}],"grading":"Na kraju kursa organizuje se završni ispit, koji obuhvata celokupno gradivo kursa. Po završetku kursa polaznicima se dodeljuje sertifikat o pohađanju ili uspešno završenom kursu, u zavisnosti od rezultata ostvarenog na završnom ispitu. Kurs je uspešno završen, ako polaznik na završnom ispitu ostvari najmanje 50% ukupno mogućih bodova (100).","image":"fundamentals.png"},"name":"Jan Struhar","eMail":"struhar.jan@gmail.com","tel":"099877466","address":"Stari tgrad 122","date":"2024-05-24T15:51:30.106Z"},{"id":22,"course":{"id":3,"name":".NET Web Development","overview":"Ovo je intenzivni kurs namenjen onima koji žele da steknu kompetencije junior full stack developer-a za razvoj web aplikacija na .NET platformi. Gradivo obuhvata razvoj serverskog dela web aplikacija upotrebom .NET tehnologija i klijentskog dela web aplikacija korišćenjem JavaScript jezika i pridruženih tehnologija.","weeks":15,"classes":132,"classesPerWeek":12,"description":"Kurs je namenjen onima koji žele da steknu kompetencije junior full stack developer-a za razvoj web aplikacija na .NET platformi. Polaznici koji uspešno završe kurs se preporučuju za poziv na selekciju za zaposlenje u kompanijama sa kojima FTN Informatika ima dogovor o saradnji. O kojim se kompanijama radi možete pogledati u sekciji Partneri.\n\nZa pohađanje kursa neophodno je da polaznici imaju predznanje iz osnova programiranja u nekom od programskih jezika visokog nivoa (C#, Java, JavaScript, C++ i slično). Kao pomoć u proceni programerskih veština interesenata za kurs, organizujemo besplatna preliminarna testiranja. Ukoliko znate da nemate predznanje iz programiranja ili to ustanovite na preliminarnom testiranju, možete se opredeliti za pohađanje kursa Osnove programiranja, koji organizujemo kao pripremu za uspešno praćenje nastave na .NET Web Development kursu.\n\nKurs .NET Web Development je podeljen na tri modula: Osnove C# programiranja (modul 1.), Osnove web programiranja (modul 2.) i Napredno web programiranje (modul 3.). Predavanja se sastoje iz kraćeg teoretskog dela, u kojem se polaznici upoznaju sa odgovarajućim konceptima i većeg broja zadataka, u kojima polaznici primenjuju naučene koncepte u praksi. Na kraju svakog predavanja polaznici dobijaju domaće zadatke, namenjene za utvrđivanje gradiva i sticanje samostalnosti u radu. Za svakog polaznika kursa obezbeđen je računar, softver neophodan za realizaciju nastave i nastavni materijal u elektronskoj formi.","price":106800,"modules":[{"name":"Modul 1. Osnove C# Programiranja","subjects":["Korišćenje Visual Studio okruženja","Poznavanje osnovnih koncepata objektnog programiranja (apstrakcija, generalizacija, polimorfizam)","Sposobnost programiranja osnovnih algoritamskih struktura i korišćenje funkcija","Sposobnost rada sa ulazom i izlazom (standardni ulaz/izlaz i fajl sistem)","Elementarni rad sa bazama podataka (osnove relacionog modela, SQL jezika i mehanizmi povezivanja C# aplikacije sa bazom podataka)","Korišćenje eksternih .NET biblioteka","Korišćenje GIT sistema za kontrolu verzija programskog koda","Korišćenje biblioteke za Unit testiranje softvera"]},{"name":"Modul 2. Osnove web programiranja","subjects":["Poznavanje osnovnih i jednog dela naprednih HTML 4 i HTML 5 koncepata i struktura","Poznavanje osnovnih i jednog dela naprednih CSS koncepata i struktura","Korišćenje Visual Studio okruženja sa akcentom na segment za web programiranje","Sposobnost korišćenja IIS veb servera (bazični principi, puštanje aplikacije u produkciju - deploy)","Poznavanje koncepata i tehnologija .NET MVC (Model View Controler), Razor, HTML Helpers, Data Annotation, Data Binding, Data Validation.","Sposobnost programiranja bazične web aplikacije koja koristi bazu podataka","Poznavanje osnovnih i jednog dela naprednih struktura JavaScript programskog jezika","Poznavanje osnovnih i jednog dela naprednih struktura JQuery","Sposobnost izrade kompetne veb aplikacije bazirane .NET MVC tehnologiji"]},{"name":"Modul 3. Napredno web programiranje","subjects":["Poznavanje koncepata i načina korišćenja Entity Framework","Poznavanje osnova objektno-relacionog mapiranja, Auto Mapper, LINQ","Scaffolding, Partial View","Poznavanje Dependency injection šablona","Poznavanje REST koncepata","Sposobnost izrade REST servisa korišćenjem ASP.NET Web API","Korišćenje Bootstrap biblioteke, Sorting, Pagination","AJAX, Ovladavanje single-page application (SPA) konceptom","Autorizacija i Autentifikacija, osnove OAuth principa"]}],"grading":"Na kraju svakog modula organizuje se poseban termin za ispit. Rezultati sa parcijalnih ispita nakon 1. i 2. modula ne utiču na sertifikaciju i služe kao informacija polazniku u kojoj meri je savladao gradivo. Nakon 3. modula organizuje se završni ispit, na osnovu kojeg se vrši sertifikacija.\n\nPo završetku kursa polaznicima se dodeljuje sertifikat o pohađanju ili uspešno završenom kursu, u zavisnosti od rezultata ostvarenog na završnom ispitu. Kurs je uspešno završen, ako polaznik na završnom ispitu ostvari najmanje 50% ukupno mogućih bodova (100).","image":"dotnet.png"},"name":"Drazen mihajlovic","eMail":"drazen@gmail.com","tel":"4882488248","address":"Zorana Djindjica 25","date":"2024-05-26T17:44:58.970Z"}]